#include <iostream>

using namespace std;

int main()
{       setlocale(LC_ALL, "Russian");
        int d, m;
        cout << "Введите номер дня от 1 до 31" << endl;
            cin >> d;
            cout << "Введите номер месяца от 1 до 12" << endl;
            cin >> m;
            if (d < 1 || d > 31 || m < 1 || m > 12) {
                cout << "не соответствует условию задачи";
            }
            else
                if ((d > 29 && m == 2) || (d > 30 && m == 4) || (d > 30 && m == 6)
                    || (d > 30 && m == 9) || (d > 30 && m == 11))
                        cout << "Такого дня не существует";
            else {
                if (d == 1) cout << "Первое ";
                if (d == 2) cout << "Второе ";
                if (d == 3) cout << "Третье ";
                if (d == 4) cout << "Четвёртое ";
                if (d == 5) cout << "Пятое ";
                if (d == 6) cout << "Шестое ";
                if (d == 7) cout << "Седьмое ";
                if (d == 8) cout << "Восьмое ";
                if (d == 9) cout << "Девятое ";
                if (d == 10) cout << "Десятое ";
                if (d == 11) cout << "Одиннадцатое ";
                if (d == 12) cout << "Двенадцатое ";
                if (d == 13) cout << "Тринадцатое ";
                if (d == 14) cout << "Четырнадцатое ";
                if (d == 15) cout << "Пятнадцатое ";
                if (d == 16) cout << "Шестнадцатое ";
                if (d == 17) cout << "Семнадцатое ";
                if (d == 18) cout << "Восемнадцатое ";
                if (d == 19) cout << "Девятнадцатое ";
                if (d == 20) cout << "Двадцатое ";
                if (d == 21) cout << "Двадцать первое ";
                if (d == 22) cout << "Двадцать второе ";
                if (d == 23) cout << "Двадцать третье ";
                if (d == 24) cout << "Двадцать четвёртое ";
                if (d == 25) cout << "Двадцать пятое ";
                if (d == 26) cout << "Двадцать шестое ";
                if (d == 27) cout << "Двадцать седьмое ";
                if (d == 28) cout << "Двадцать восьмое ";
                if (d == 29) cout << "Двадцать девятое ";
                if (d == 30) cout << "Тридцатое ";
                if (d == 31) cout << "Тридцать первое ";

                if (m == 1) cout << "января";
                if (m == 2) cout << "февраля";
                if (m == 3) cout << "марта";
                if (m == 4) cout << "апреля";
                if (m == 5) cout << "мая";
                if (m == 6) cout << "июня";
                if (m == 7) cout << "июля";
                if (m == 8) cout << "августа";
                if (m == 9) cout << "сентября";
                if (m == 10) cout << "октября";
                if (m == 11) cout << "ноября";
                if (m == 12) cout << "декабря";
            }

}
