#include <iostream>

using namespace std;

int main()
{   setlocale(LC_ALL, "Russian");
    int a;
     cout << "Введите целое число в диапазоне 100-999" << endl;
            cin >> a;
            if (a < 100 || a > 999)
                cout << "Не удовлетворяет условиям задания";
            else {
                if (a / 100 == 1) cout << "Сто";
                if (a / 100 == 2) cout << "Двести";
                if (a / 100 == 3) cout << "Триста";
                if (a / 100 == 4) cout << "Четыреста";
                if (a / 100 == 5) cout << "Пятьсот";
                if (a / 100 == 6) cout << "Шестьсот";
                if (a / 100 == 7) cout << "Семьсот";
                if (a / 100 == 8) cout << "Восемьсот";
                if (a / 100 == 9) cout << "Девятьсот";

                a %= 100;
                if (a < 20 && a > 9) {
                    if (a == 10) cout << " десять";
                    if (a == 11) cout << " одиннадцать";
                    if (a == 12) cout << " двенадцать";
                    if (a == 13) cout << " тринадцать";
                    if (a == 14) cout << " четырнадцать";
                    if (a == 15) cout << " пятнадцать";
                    if (a == 16) cout << " шестнадцать";
                    if (a == 17) cout << " семнадцать";
                    if (a == 18) cout << " восемнадцать";
                    if (a == 19) cout << " девятнадцать";
                }
                else {
                    if (a / 10 == 2) cout << " двадцать";
                    if (a / 10 == 3) cout << " тридцать";
                    if (a / 10 == 4) cout << " сорок";
                    if (a / 10 == 5) cout << " пятьдесят";
                    if (a / 10 == 6) cout << " шестьдесят";
                    if (a / 10 == 7) cout << " семьдесят";
                    if (a / 10 == 8) cout << " восемьдесят";
                    if (a / 10 == 9) cout << " девяносто";

                    if (a % 10 == 1) cout << " один";
                    if (a % 10 == 2) cout << " два";
                    if (a % 10 == 3) cout << " три";
                    if (a % 10 == 4) cout << " четыре";
                    if (a % 10 == 5) cout << " пять";
                    if (a % 10 == 6) cout << " шесть";
                    if (a % 10 == 7) cout << " семь";
                    if (a % 10 == 8) cout << " восемь";
                    if (a % 10 == 9) cout << " девять";
                }

            }
}
